using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading;
using System.Threading.Tasks;

namespace Cybersecurity_Chatbot
{
    internal class Logo
    {
        public static void AnimatedLogo()
        {
    string[] logo =
    {
        "███╗   ██╗███████╗████████╗     ███████╗ █████╗ ███████╗███████╗",
        "████╗  ██║██╔════╝╚══██╔══╝     ██╔════╝██╔══██╗██╔════╝██╔════╝",
        "██╔██╗ ██║█████╗     ██║        ███████╗███████║█████╗  █████╗  ",
        "██║╚██╗██║██╔══╝     ██║        ╚════██║██╔══██║██╔══╝  ██╔══╝  ",
        "██║ ╚████║███████╗   ██║        ███████║██║  ██║██║     ███████╗",
        "╚═╝  ╚═══╝╚══════╝   ╚═╝        ╚══════╝╚═╝  ╚═╝╚═╝     ╚══════╝",
        "",
        "           Cybersecurity Awareness Assistant - NET SAFE"
     };

            foreach (string line in logo)
            {
                string output = "";

                foreach (char c in line)
                {
                    output += c;
                    Console.ForegroundColor = ConsoleColor.Blue;
                    Console.Write("\r" + output);
                    Thread.Sleep(1);
                }

                Console.WriteLine();
            }

            Console.ResetColor();
        }
    }
}

